# SETUP

In [1]:
import pandas as pd
import numpy as np

# Week 2 Activity

## Instructions

***If you have any issues, please visit the help section of the course.***

***To reset all of the outputs, use the menu to go to Cell -> All Output -> Clear***

**For this assignment, make sure to start from the top and work down**

1) First, import the studentinfo.csv dataset into R as a data frame named D1. To do so, click on the cell below and press Shift + Enter

```
D1 <- read.csv("studentInfo.csv", header=TRUE)
```

In [2]:
file = '/Users/quartz/data/learning_analytics/learning_analytics_fundamentals/studentInfo.csv'
D1 = pd.read_csv(file)
D1.tail()

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
32588,GGG,2014J,2640965,F,Wales,Lower Than A Level,10-20,0-35,0,30,N,Fail
32589,GGG,2014J,2645731,F,East Anglian Region,Lower Than A Level,40-50%,35-55,0,30,N,Distinction
32590,GGG,2014J,2648187,F,South Region,A Level or Equivalent,20-30%,0-35,0,30,Y,Pass
32591,GGG,2014J,2679821,F,South East Region,Lower Than A Level,90-100%,35-55,0,30,N,Withdrawn
32592,GGG,2014J,2684003,F,Yorkshire Region,HE Qualification,50-60%,35-55,0,30,N,Distinction

2) Create a new dataframe from `D1` that only contains the student ID and the presentation for students from Ireland, again by clicking the cell below and pressing Shift + Enter. As with last week's assignment, you will see some text on a light red background that says "Attaching package: 'dplyr'". You can ignore the text with the red background

```
library(dplyr)
D2 <- filter(D1, region == "Ireland")
D2 <- select(D2, id_student, code_presentation)
D2
```

In [5]:
D2 = D1[D1.region == "Ireland"]
D2 = D2[['id_student', 'code_presentation']]
D2.head()

    id_student code_presentation
17       71361             2013J
28      104476             2013J
65      172112             2013J
66      172797             2013J
88      227517             2013J

3) Create a new variable (column) called “count” that only contains the number 1 for each entry.

```
D2$count <- 1
```

In [6]:
D2['count'] = 1
D2.head()

    id_student code_presentation  count
17       71361             2013J      1
28      104476             2013J      1
65      172112             2013J      1
66      172797             2013J      1
88      227517             2013J      1

4) Using the “spread” function from the “tidyr” package, create a new data frame `D3` in wide format. There will be a column for the student ID number, and one column for each registration date. The columns for each registration date should contain the value 1 if the student on that row registered for that date, and the value NA if they did not.

```
library(tidyr)
D2 <- unique(D2)
D2 <- spread(D2, code_presentation, count)
D2
```

5) Next, remove missing data by listwise deletion using `na.omit()`. This will remove rows that contain any `NA` values.

```
D3 <- na.omit(D2)
D3
```

6) Find the ID number for the student that participated in all four courses and enter it in edX.

In [12]:
# find Nan Value

D2.isna().sum()

id_student           0
code_presentation    0
count                0
dtype: int64

In [18]:
D2.shape

(1184, 3)

In [11]:
len(np.unique(D2.id_student)), len(np.unique(D2.code_presentation))

(1072, 4)

In [21]:
# group by 'code_presentation'

D2.groupby(by='code_presentation').count()

                   id_student  count
code_presentation
2013B                     184    184
2013J                     347    347
2014B                     211    211
2014J                     442    442